Core/src/src/Catalogs/ИнтеграцииСБанками/ИнтеграцииСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтеграцииСБанками</name>
  <predefined>
    <items>
      <name>BAGAGE22</name>
      <description>BAGAGE22</description>
    </items>
    <items>
      <name>MIBGGE22</name>
      <description>MIBGGE22</description>
    </items>
    <items>
      <name>TBCBGE22</name>
      <description>TBCBGE22</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеКонстанты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/Catalogs/ИнтеграцииСБанками/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыНаСервере()
	
	Если Объект.Ссылка = Справочники.ИнтеграцииСБанками.BAGAGE22 Тогда 
		Константы.ИспользоватьЗагрузкуИзБанка.Установить(Объект.ЗначениеКонстанты);
	ИначеЕсли Объект.Ссылка = Справочники.ИнтеграцииСБанками.TBCBGE22 Тогда
		Константы.ИнтеграцияСБанкомTBC.Установить(Объект.ЗначениеКонстанты);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗначениеКонстантыНаСервере();
	
КонецПроцедуры
